### для venv: & ".\.venv\Scripts\Activate"
### для папки: cd DRL_pricing
### для докера: pip freeze > requirements.txt

import random as rnd
import numpy as np
import torch

### иницализация randomseed

rnd.seed(42)
torch.manual_seed(42)

### начальные условия: инициализация весов для всех алгоритмов
### инициализация гиперпараметров: n, m, \delta, \gamma,
### c_i, h^+, v^-, \eta

### количество итераций внутри среды
T = 100

### количество симуляций среды
ENV = 2

n = 2               # число фирм
m = 5               # горизонт памяти платформы
delta = 0.6         # коэффициент дисконтирования
gamma = 0.5         # склонность доверия рекламе
c_i = 1             # издержки закупки товара
h_plus = 0          # издержки хранения остатков
v_minus = 0         # издержки экстренного дозаполнения
eta = 0.05          # вероятность оставить отзыв
p_inf = c_i         
p_sup = 10

for env in range(ENV):

    ### Инициализация памяти фирм
    # FirmMemory = ... 
    Q = np.zeros((n,k))

    ### Инициализация памяти платформы

    ### Инициализация памяти в отзывах

    ### Инициализация основного цикла

    for t in range(T):

        ### взаимодействие
        print(rnd.randint(1, 10))

        continue
